In [1]:
import pandas as pd
import numpy as np

In [2]:
Sozluk1 = {"Isım": ["ahmet","mehmet","zeynep","saadet"],
          "Spor": ["koşu","yüzme","ağırlık","tırmanış"],
          "Kalori": [100,200,300,400]}

In [3]:
dataFrame = pd.DataFrame(Sozluk1,index = [0,1,2,3])

In [4]:
dataFrame

     Isım      Spor  Kalori
0   ahmet      koşu     100
1  mehmet     yüzme     200
2  zeynep   ağırlık     300
3  saadet  tırmanış     400

In [11]:
Sozluk2 = {"Isım": ["osman","levent","ayşe","fatma"],
          "Spor": ["koşu","yüzme","ağırlık","tırmanış"],
          "Kalori": [120,240,390,420]}

In [12]:
dataFrame2 = pd.DataFrame(Sozluk2, index = [4,5,6,7])

In [13]:
Sozluk3 = {"Isım": ["özgür","cansu","leyla","cemil"],
          "Spor": ["koşu","yüzme","ağırlık","tırmanış"],
          "Kalori": [170,249,490,620]}
dataFrame3 = pd.DataFrame(Sozluk3, index = [8,9,10,11])

In [9]:
dataFrame

     Isım      Spor  Kalori
0   ahmet      koşu     100
1  mehmet     yüzme     200
2  zeynep   ağırlık     300
3  saadet  tırmanış     400

In [14]:
dataFrame2

     Isım      Spor  Kalori
4   osman      koşu     120
5  levent     yüzme     240
6    ayşe   ağırlık     390
7   fatma  tırmanış     420

In [15]:
dataFrame3

     Isım      Spor  Kalori
8   özgür      koşu     170
9   cansu     yüzme     249
10  leyla   ağırlık     490
11  cemil  tırmanış     620

## Concatenation

In [16]:
# kolonlar aynıysa tabloları birleştirmek için bu işlem yapılır.

In [17]:
pd.concat([dataFrame,dataFrame2,dataFrame3])

      Isım      Spor  Kalori
0    ahmet      koşu     100
1   mehmet     yüzme     200
2   zeynep   ağırlık     300
3   saadet  tırmanış     400
4    osman      koşu     120
5   levent     yüzme     240
6     ayşe   ağırlık     390
7    fatma  tırmanış     420
8    özgür      koşu     170
9    cansu     yüzme     249
10   leyla   ağırlık     490
11   cemil  tırmanış     620

## MERGE

In [19]:
yeniTablo1 = {"Isım": ["ahmet","özgür","selin","ceyda","esra"],
             "Spor": ["koşu","yüzme","basketbol","ağırlık","futbol"]}
yeniDataFrame = pd.DataFrame(yeniTablo1, index = [0,1,2,3,4])

In [20]:
yeniTablo2 = {"Isım": ["ahmet","özgür","selin","ceyda","esra"],
             "kalori": [100,200,300,400,500]}
yeniDataFrame2 = pd.DataFrame(yeniTablo2, index = [0,1,2,3,4])

In [21]:
pd.merge(yeniDataFrame,yeniDataFrame2,on="Isım")

    Isım       Spor  kalori
0  ahmet       koşu     100
1  özgür      yüzme     200
2  selin  basketbol     300
3  ceyda    ağırlık     400
4   esra     futbol     500

In [22]:
#ortak olan kolonu on şeklinde belirtiyorum

In [23]:
#böylelikle benim birinci tabloda olan değerlerimin yanında eklediğim diğer kolon da birlikte geliyor.

## Trikler

In [25]:
#verisetimde tekrar etmeyen verileri almak istiyorum.

In [38]:
maasSozluk = {"Isım": ["ahmet","leyla","ceyda","selim"],
             "departman": ["pazarlama","yazılım","yazılım","yazılım"],
             "maas": [1000,1000,1300,2400]}
maasDataFrame = pd.DataFrame(maasSozluk)

In [39]:
maasDataFrame

    Isım  departman  maas
0  ahmet  pazarlama  1000
1  leyla    yazılım  1000
2  ceyda    yazılım  1300
3  selim    yazılım  2400

In [40]:
maasDataFrame["departman"].unique()

array(['pazarlama', 'yazılım'], dtype=object)

In [41]:
#dediğim zaman bana tekrar eden değerleri getirmez sadece tek olan veriker döner.

In [42]:
maasDataFrame["departman"].nunique()

2

In [43]:
maasDataFrame["departman"].value_counts()

departman
yazılım      3
pazarlama    1
Name: count, dtype: int64

In [44]:
def brutNet(maas):
    return maas * 0.66

In [45]:
maasDataFrame["maas"].apply(brutNet)

0     660.0
1     660.0
2     858.0
3    1584.0
Name: maas, dtype: float64

In [46]:
#böyle yaparak maas kolonundaki tüm verileri 0.66 ile çarpmış oldum.

In [47]:
maasDataFrame.isnull()

    Isım  departman   maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [49]:
#isnull diyerek boş değer olup olmadığını kontrol edebiliyorum.
# bu fonksiyon boolean olarak çalışır ve eğer boş değer varsa True döndürür.
# bizim şu anda listemizde boş değer yok.